[
    {
        "id": 1,
        "title": "My Website Building Adventure: ChatGPT, Challenges, and What's Next",
        "author": "Gerard McNally",
        "date": "2025-01-01",
        "content": "<p>My dream of having a website, specifically one focused on the growing world of sports betting, quickly turned into a crash course in coding, AI limitations, and the importance of planning. I started out thinking, \"I'll just create a static webpage and go from there.\" I had no idea what challenges lay ahead. Here's the story of my website building adventure so far, and what I've learned along the way.</p>\n\n<h2>My Journey So Far</h2>\n<p>I started out exploring sites like wix.com, Wordpress, Squarespace and new entirely AI based site creator called dorik.com. My experience with the CMS website builders wasn’t great, I felt like there was a steep learning curve to be able to use their products. I also felt like there just wasn't the scope for being able to build the product the way you like but maybe I just didn't stick with them for long enough. This led me to dive in and try to do the actual coding myself. To help me build this site I used ChatGPT as a coding co-pilot. One other tool that I used that was essential was canva.com. A lot of the artwork you see on the site is from canva's dreamlab feature.</p>\n\n<p>I am committed to sticking with the site and trying to grow it from 0 users today to some number in the future I can be proud of. I have decided not to define a goal for the active users number because I think actual number based goals in that fashion can be a bit demoralising when you’re shooting for something quite difficult. For me it's akin to something like starting running, if I personally started that with the mindset of \"i'm going to run a marathon\" I'd say i'd quit early. One site that I’ve checked out that is quite similar or that is something I’d aspire to has 12,000 users per month which I think is quite impressive. If I could get anywhere near that in the next 12 to 24 months that would be incredible.</p>\n\n<h2>Lessons learned</h2>\n\n<p>I can say this, starting out on a journey of trying to build something out of nothing in the digital world is quite scary. I think staying off social media and trying not to let it impact you in terms of what people are saying is good advice. That’s quite an easy thing to say but everything you read says you need to use social media to help generate traffic so a bit of a dilemma there in my opinion. What I will also say about trying to build a site and with it a user base is that you learn a lot trying to embark on the journey. This journey has given me a newfound respect for many aspects of website development.</p>\n\n<p>Some skills you really need when trying to build a site include:</p>\n\n<p>Knowledge of user experience and design: I don’t know if this is the most important thing but it’s certainly one area I’ve found myself sorely lacking in. There are so many things to think about and it's hard to explain how difficult it is to not make a complete mess of what was previously a nice white space.\nRespect for website architecture: This one very quickly became a nightmare for me. As you move through creating what you think is a cool little page you soon realise you're hard coding everything into the site (meaning you're writing the code directly into each page instead of using a more flexible system), and so small changes or additions become pretty difficult. The importance of the structure and architecture and planning of the site became clear when I really got stuck into building out the blog.html page. Once you're into building your own CMS to serve your blogs things become much more challenging.</p>\n\n<p>Understanding of the limitations of ChatGPT: ChatGPT is a brilliant tool please do not get me wrong and I'm very grateful to have it but from my experience there are real challenges if you're coming in with no experience and asking it to try and help you build a website. It easily forgets things and as the site builds up it can lead you down some seriously challenging paths. The site wouldn't have been possible without ChatGPT but I will say that I don't think we're in the place where AI replaces everything for quite some time. There are limitations to what it can do, I know that is mis-aligned to the common narrative from the wider online community but in my opinion it's true.</p>\n\n<h2>Challenges with AI</h2>\n<p>All this being said the text at the bottom of the text box does say it all \"ChatGPT can make mistakes. Check important info.\" To close this point off I'll highlight something interesting that I asked ChatGPT and Gemini when I was quite deep into the project.</p>\n\n<p>The questions were:</p>\n\n<p>ChatGPT: \"Could I write enough code with you to start an online casino?\"</p>\n<p>Gemini: \"Could I write enough code with you to start an online casino?\"</p>\n\n<p>The answers I got back were wildly different.</p>\n\n<p>ChatGPT: \"Yes, you could absolutely write enough code to start an online casino with my assistance...\"</p>\n<p>Gemini: \"No, you can't write enough code with me to start an online casino...\"</p>\n\n<p>Pretty interesting answers in both cases and maybe one is better than the other for reasons that you wouldn't expect. You could potentially waste a lot of time messing around trying to pull that off with ChatGPT whereas the Gemini answer is the one that's truthful... Food for thought in the whole world of thinking that \"Open AI has won the AI battle\" narrative.</p>\n\n<h2>Future Plans</h2>\n\n<p>I said I would use this post to lay out what to expect in the coming days and weeks and that is what I'll attempt to do to wrap up. What you can expect is that I'll keep building the site and improving the UX, I think that's the most important thing, let's called it priority 1A \"Have an awesome experience that people like using\". Then I'll try and produce content people like, focusing initially on topics like understanding betting odds and bankroll management. Priority 1B and then I'll start experimenting with features to try and keep people interested and coming back, possibly things like a weekly betting tip or a community forum. Priority 1C.</p>\n\n<p>Want to stay up-to-date on my progress and get exclusive sports betting insights? Sign up for my weekly newsletter below!</p>\n\n<p>This is just the beginning of my journey with SportsBetGrowth. It's been challenging, frustrating, and incredibly rewarding all at the same time. I'm excited to keep learning, building, and sharing my experiences with you. If you're interested in following along, sign up for my newsletter below. I promise to only send one email a week, sharing updates, new blog posts, and maybe even some tips on navigating the world of sports betting. Thanks for reading!</p>\n\n",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-one.jpg"
    },
    {
        "id": 2,
        "title": "The Growth of the UK Gambling Industry",
        "author": "Gerard McNally",
        "date": "2024-01-02",
        "content": "<p>The UK gambling industry has exploded over the last 15 to 20 years. In this post, I'll share my personal experiences in the gambling industry. I'll also analyse data from the UK Gambling Commission website. My analysis of the data reveals a concerning trend: the unchecked growth of online casinos. This growth has potential consequences for the entire industry. This isn't just about numbers; it's about the potential for real harm and the need for a serious conversation about responsible gambling in the digital age. It's time for a serious conversation about responsible gambling in the digital age and this conversation needs to focus on the unchecked growth of online Casinos.</p>\n\n<p>I've often struggled with the morality of the gambling industry. I question whether my more libertarian views from my 20s and 30s still apply. The UK gambling industry has seen ups and downs over the past 20 years. From a press perspective, I'd say it currently has a relatively bad image. I experienced this firsthand when I started a business. I applied for funding through the Go Succeed program, a local initiative in Northern Ireland, but was denied. After a few interviews with them they came back with the following very sobering statement \"As per Go Succeed’s policies, we are unable to engage with businesses that are involved in gambling-related activities due to ethical and reputational concerns. We strive to align with partners whose business practices reflect the values and standards that we uphold.\"</p>\n\n<p>While they were transparent, it raises questions about the government's priorities. Who is influencing gambling policy in the UK? Incentive programs for businesses that might disrupt the status quo are clearly not a priority in Northern Ireland. Generally, raising money in the gambling industry is difficult. You're often limited to private individuals with their own funds.</p>\n\n<h2>The Rise of Online Casinos</h2>\n<p>On to what I really wanted to highlight with this post. I was recently researching the growth of the UK gambling industry over the last 15 years and I came upon some numbers that create a pretty stark picture of where we're heading. For clarity all numbers referenced in this blog post come from https://www.gamblingcommission.gov.uk/statistics-and-research/collection/the-gambling-market. The gross gambling yield of the Great Britain gambling industry was 15.6 billion pounds for the year ending March 2024. The last time the UKGC published numbers was in November 2024. The numbers for for this total gross gambling yield break out into five main categories:</p>\n\n<p>Arcades - Non Remote</p>\n<p>Betting - Non Remote & Remote</p>\n<p>Bingo - Non Remote & Remote</p>\n<p>Casino - Non Remote & Remote</p>\n<p>Lotteries - Non Remote & Remote & The National Lottery Non Remote & Remote</p>\n\n<p>Going back to 2008 which is as far back as the UKGC publishes that I could easily find on their site, the industry was worth about roughly half of what it is worth today. For the period April 2008 to March 2009 the industry was worth 8,36 billion pounds of total gross gambling yield. Back then the total for Casino in terms of gross gambling yield was a paltry 829.25 million, this was, as a percentage of the total yield, 9.91%. Today the total gross gambling yield for Casino as a whole stands at 5,22 billion pounds. Most concerning for me it has increased significantly in the remote category. The non-remote numbers have stayed relatively stable over the last 15 years, the remote number has increased from 33 million in 08/09 to 4,36 billion in 23/24 - a staggering increase of over 13,000%. The government hasn't gone and allowed the opening a load of land based Casinos they've allowed the proliferation of remote based casinos i.e. online casino.</p>\n\n<p>I understand the conversation about FOBT's (Fixed Odds Betting Terminals) and how much harm they were causing but that is an absolute drop in the ocean compared to what has been allowed to happen with remote Casino operators in the UK over the last 15 years. The explosive growth in online casino feels even more concerning when you consider the nuanced differences between Casino and Sports Betting.</p>\n\n<h2>The Difference Between Sports Betting and Casino</h2>\n<p>Online betting differs from online casino by the fact that customers do stand a chance of being a winner in the long run. This is something that makes both products distinctly different. The regulations for certain legalised markets actually bake in how much operators are legally allowed to take from customers in for Casino games. In Colombia (a regulated market) for example the regs actually state what the return to the customer must be, 83%. So that means the maximum the operator is allowed to take from customers in the long run is 17%, i.e. 17 pesos for every 100 that is bet. This regulation is designed to protect customers by limiting how much operators can profit from Casino games.</p>\n\n<p>The numbers absolutely speak for themselves in terms of where the real growth in the industry has come. Today the Casino number stands at 33.42% (5,224 billion of the 15,6 billion total) of the total gross gambling yield overall in the UK. Over that time betting as a percentage of the total has decreased from 44.07% to 31.11%. In real terms going from 3,68 to 4,86 billion pounds of gross gaming yield. My real concern is that customers are increasingly playing on products that they stand no chance of winning from in the long run. I guess it's the same with the lottery but those overall percentage numbers have stayed relatively static hovering at or around 30% for the last 15 years.</p>\n\n<h2>The Government's Role</h2>\n<p>From my perspective, while I understand that gambling is by and large a source of harmless entertainment for the many. While there have been many measures introduced for responsible gambling like deposit limits, reality checks and self exclusion programs, I believe they're not enough. They don't prevent those determined enough from causing themselves harm. I think the government should be looking long and hard at the growth of revenues from the remote Casino space. A serious question needs to be asked if these are the sorts of products we want newcomers to gambling using as their first product. I know I'd much rather someone placed a sports bet than ever downloaded an online casino to their phone, it's just too easy for things to go wrong... Ultimately I think the government in the UK should consider whether they want online Casino to continue to grow in the fashion it has over the last 15 years because we're currently on a trajectory where it will soon dominate the gambling landscape.</p>\n\n<p>The data is clear and the trend is only heading in one direction for remote Casino, and we need to act now to change course. We need a serious conversation and clear distinctions made between customers who place bets on sports and have a chance of being a winning player in the long run a customers who ultimately stand no chance of winning in the long run playing Online Casino. The sports betting industry takes an enormous amount of negative press and yet the growth of Online Casino proceeds uninhibited. I urge you to contact your local MP about your concerns regarding the growth of online casinos.</p>\n\n<p>There is a link to the google sheet I pulled together to see the data clearly laid out. Hope you liked the post and see you tomorrow for another.</p>",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-two.jpg"
    },
    {
        "id": 3,
        "title": "How to build a website using AI",
        "author": "Gerard McNally",
        "date": "2025-01-03",
        "content": "For today's blog I wanted to write about my experience building a website from scratch using AI with no developer experience. I had this idea \"to build a website\" a few months back after I quit my job. I thought it would be a great project to undertake while I figured out what I wanted to do next in my career. Overall the experience with GPT was pretty easy to get started with. I did have some experience previously writing a backend python application that could called an API for the Betfair Exchange and bet into it in an automated fashion. That gave me a good base to understand IDE's (Integrated Development Environment). I'd say without that previous experience I wouldn't be as close to thinking about publishing the site as I am. \n\nIn terms of what I'm trying to do, it's like this, I am trying to build something from scratch on my own that has 0 users today and to try and scale that to have say 1000 users per month. Within that I would then like to be able to monetise those users in some manner. In doing this I want to build a product that is legitimate, i.e. not a scam. I want to build a product that helps people and that they enjoy using and that they have an overall positive experience with. When you lay it out like that it's a pretty enormous challenge and one that I am probably destined to fail at. However I don't think that's any reason not to try it. Ideally I'll be working for myself and not for a company that isn't my own. Having a company job and everything that goes along with that is amazing and I'm very grateful for all the safety and security I was provided by all the companies that have employed me in the past (and this isn't to say I don't want to work for a company again) but my aspiration is to be able to built something myself that ticks all the boxes above and is my own. \n\nSo then on to the experience of trying to build this site with no experience as a front end developer using only AI tools. Personally I've found it quite difficult on the whole. I think I assumed that getting into this would be more straight forward than it has been. In terms of how I'd approach it if I were to start out. I think it would go as follows, spent a week or two actually defined what features and what pages I wanted for launch and being ruthless about that. One of the biggest struggles was deciding what to put on the homepage. My homepage isn't particularly content heavy but it was pretty difficult just defining the sections themselves. Here goes in terms of what the homepage I have consists with for launch. \n\nNavbar - this took a long time to get anywhere close to being right. You think it's just a few links, a logo and a button but the main challenge is having the thing be responsive for mobile devices. If I were to build it again I'd have two requirements: Navbar for desktop and Navbar for mobile. I probably spent a week of my life examining other sites mobile hamburger menus or lack thereof. My favourite is on https://uk.rad-global.com/collections/r-a-d-one it's really cool. \n\nHero Section - this is the section you see on a website that is basically everything you see before you have to scroll anywhere. Again this took me a long time and I found it very difficult to design. I went through many iterations of the code before I settled on what I have. It has one heading, one paragraph, a CTA button and the hero image. Stripping everything back and trying to be a simplistic as possible was the best path forward for me with this. \n\nServices Highlights - This section could probably use a better name but the design behind this section is to give the user reasons to sign up to the newsletter and to let them know what they will get for signing up. GPT is quite fond of proposing a grid as the solution to a FE IX problem (or maybe it knows I like grids and just proposes them all the time now - I'm not sure). \n\nOur Work Section - This was probably one of the simpler parts of the site, although it did take me some time to figure out how to re-size an image in canva and to get all the text to align on desktop. It gets a bit frustrating when you have your mobile experience all lined up but are spending time on the UX for desktop. That comes from a past history of no one caring about the desktop experience they delivered to customers, \"mobile first\" was an oft touted way to success in my early career in the gambling industry.\n\nHear from our subscribers - this section is affectionately in the realm of \"social proof\" which is a new concept for me since I've started into trying to build something from the ground up. I think it is one of those flywheel things that it's actually really hard to get started but once you do get it started then it can really help you take off. In terms of building it with AI that was pretty straightforward when you just want something static to capture feedback from your first few mates who use the product. The challenge that's awaiting me is building out a small back end and database for it so I don't have to do an integration with a third party.\n\nLatest Blogs - this was the most challenging part of the site to build to date and the one I had most trouble with overall. I would say this is where I can provide some learnings to others, I originally had this as a hard coded part of the site and went off doing some relatively simple UX bits and pieces (probably focusing on the hero section and styling it to death) but when I then turned my attention to actually writing some blogs it became abundantly obvious that I wouldn't be able to be in the actual code adding 1000 word blogs to the site without causing chaos.\n\nI'll continue with this blog on a later day. So far so good in 2025 3 days and 3 blogs. Keep er lit.",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-three.jpg"
    },
    {
        "id": 4,
        "title": "The SBG Top 100 Books Series",
        "author": "Gerard McNally",
        "date": "2024-12-28",
        "content": "I decided I wanted to write a blog post about the top 100 books I could find from making searches for certain keywords on Amazon. I started out with the idea of searching for the term \"gambling\" on Amazon to understand what books would make it into the featured search list and what the list looked like from a trends perspective. I hoped that maybe I'd find some new gems to read that would tell the history or story of gambling and the intrinsic link between gambling and the overall evolution of humanity. As I reflected on what I saw I also then decided to search for other keywords that you could say were in some way related to my search for the term \"Gambling\". One other term related to \"Gambling\".\n\nSo as I searched on amazon for the term \"Gambling\" there was a pretty obvious theme that came up that was again a trigger for me to consider the overall morality of having worked in the Sports Betting industry for my entire adult life. In the list as I made my initial scan of it the concept of addiction or problem gambling or needing to stop gambling was very evident in the list of books that were return. While being disappointed initially the search was quite interesting for me as I felt like it told a bit of a story about gambling in general and how it is currently received in the mainstream. So for qualifiers on the search I actually did I made the search using a Cypriot internet connection and on my own logged in Amazon account (maybe they personalise results). There were 323 total results for the search and surprisingly for me books that have 0 or very poor reviews can jump to the top of featured. I'm not sure if that's an opportunity or not and how you could possibly influence the featured tab on amazon for specific search terms but that's probably a mission for another day.\n\nWhat I will say about the featured books when you search for gambling is that it doesn't make for a particularly compelling list of reads in my opinion if you review the list. 6 of the top 10 books contain the words \"Addiction\", \"Stop\" or \"Addict\" or some combination of all three. To go a little deeper 16 of the top 49 books on gambling reference the word \"addiction\", \"stop\" or \"addict\". I think that creates a picture that people don't particularly come to amazon to learn how to be a better gambler they come to Amazon when they have a problem and are seeking a solution to their problem gambling. In my review of the list I went deep enough, actually pulling in the titles of the top 49 books on the featured tab into a google sheet.\n \nThis is where I took a little bit of a direction changes to understand if this sort of narrative existed with other \"vices\" when you searched for books on them. My next port of call was a search for the term \"drinking\" and it's a similar story with 8 of the top 10 books referencing stopping drinking in some sense or other. I'll be honest I was expecting a lower number of stopping or addiction related results.\n\nWhere things got more interesting is an amazon search of the word \"cocaine\" brings back an altogether different list of books. In that top 10 of featured books on cocaine only a paltry 4 out of 10 books deal with addiction. Some of the titles returned are altogether pretty shocking. \"Cocaine for beginners\", \"101 ways to sell cocaine\", \"how a small town boy made $100 million with the Medellin cartel\" and \"The king of UK cocaine smugglers\" are notable entries in the top 10 list. Another notable mention at number 11 in the list is the incredibly titled \"The pleasures of Cocaine\". I'm in no way trying to trivialise the harmful nature of problem gambling but could you imagine a list of books related to gambling that included a book title called \"The pleasures of legalised online sports betting\" - I think you would essentially be commissioning a small army of very upset people from the UK to camp outside your home demanding a withdrawal of your book of heresy. Two other notable mentions in the cocaine list include \"Cocaine Cowboys\" twice and another very glamorous title called \"Cocaine + Surfing\". I think Cocaine and surfing are probably two things I could never see going together but \"a sordid history of surfings greatest love affair\" seems to strike an entirely different tone. \n\nNow to really ramp things up in this conversation of problem vices and perception I then amazon searched the somewhat safer term of \"cannabis\". You will be shocked to find out that there is only one entry in the top 10 list of featured books that references any sort of help with quitting cannabis smoking or consumption. I'm not trying to equate vices but cannabis in the UK is an illegal class B substance, if you were unaware of this were to use this amazon search as the basis for what is legal and illegal you would say Gambling & Drinking are absolutely illegal given their damaging nature and Cocaine and Cannabis consumption and distribution are laudable things that are definitely legal. \n\nFor me personally the glamorisation of cocaine smuggling and use in the list of books in the amazon featured list and contrasting that with what is happening with gambling is a very difficult one to rationalise. Going back to a previous topic we've hit on in the blog previously I do have a problem with the unabated growth of legalised remote based Casino betting and the difficulties that creates for people based on the Random Number Generated backbone of the product and the propensity for customers to lose money betting on these casino based games. If the product is actually beatable for a customer then I think it's an entirely different proposition and people should be able to clearly see that distinction. Maybe they're features of prohibition and legality... but it still feels off. \n\nIt is interesting that we do have a culture where you can just write a book about something as serious as addiction and get it published. I'm not trying to say that for certain all authors who publish books about something so serious as a gambling addiction but I do think it's an interesting feature of society. Person, who may or may not be qualified, writes book that a person picks up and reads in the hope of coming to some realisation that may well help them with something like a gambling addiction. ",
        "image": "blog5.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-four.jpg"
    },
    {
        "id": 5,
        "title": "The SBG Top 100 Books Series",
        "author": "Gerard McNally",
        "date": "2024-12-29",
        "content": "The Top 10 Books on 'Betting' on Amazon",
        "image": "blog6.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-five.jpg"
    },
    {
        "title": "SportsBetGrowth Site Launch",
        "author": "Gerard McNally",
        "date": "2024-12-31",
        "content": "Today is a great day because the CMS is working.",
        "image": "blog7.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-six.jpg",
        "id": 6
    },
    {
        "title": "What I Learnt Working in the Gambling Industry",
        "author": "Gerard McNally",
        "date": "2025-01-01",
        "content": "It was a difficult time. ",
        "image": "blog8.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-seven.jpg",
        "id": 7
    },
    {
        "title": "The SBG 100 Blogs in 100 Days Challenge",
        "author": "Gerard McNally",
        "date": "2025-01-01",
        "content": "I have decided to take on the challenge to write 100 blog posts in 100 days in 2025. Hopefully this will help build the site with some great content.",
        "image": "blog9.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-eight.jpg",
        "id": 8
    },
    {
        "title": "How to Build a Website Using AI - Part Two",
        "author": "Gerard McNally",
        "date": "2025-01-12",
        "content": "TBC",
        "image": "TBC",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-nine.jpg",
        "id": 9
    }
]