[
    {
        "id": 1,
        "title": "What to Expect in Coming Days & Weeks",
        "author": "Gerard McNally",
        "date": "2025-01-01",
        "content": "Hi and welcome to the SportsBetGrowth website. This is the first blog post ever written for the site. I started this site because I always wanted a website and I wanted to build something that I could point to and say \"here is some work I’ve actually done entirely on my own\". It started out as a relatively simple and naive thought, \"I’ll create a static webpage and go from there\". Once you get into the business of actually building a website things become a lot more complicated than you might expect. \n\nI started out exploring sites like wix.com, Wordpress, Squarespace and new entirely AI based site creator called dorik.com. My experience with the CMS website builders wasn’t great, I felt like there was a steep learning curve to be able to use their products. I also felt like there just wasn't the scope for being able to build the product the way you like but maybe I just didn't stick with them for long enough. This led me to dive in and try to do the actual coding myself. To help me build this site I used ChatGPT as a coding co-pilot. One other tool that I used that was essential was canva.com. A lot of the artwork you see on the site is from canva's dreamlab feature.\n\nMy original thought for this post was to lay out what the plan would be for the weeks and months ahead. I'd like to try and give some detail on that so people know what to expect. I am committed to sticking with the site and trying to grow it from 0 users today to some number in the future I can be proud of. I have decided not to define a goal for the active users number because I think actual number based goals in that fashion can be a bit demoralising when you’re shooting for something quite difficult. For me it's akin to something like starting running, if I personally started that with the mindset of \"i'm going to run a marathon\" I'd say i'd quit early. One site that I’ve checked out that is quite similar or that is something I’d aspire to has 12,000 users per month which I think is quite impressive. If I could get anywhere near that in the next 12 to 24 months that would be incredible. \n\nI can say this, starting out on a journey of trying to build something out of nothing in the digital world is quite scary. I think staying off social media and trying not to let it impact you in terms of what people are saying is good advice. That’s quite an easy thing to say but everything you read says you need to use social media to help generate traffic so a bit of a double entendre there in my opinion. What I will also say about trying to build a site and with it a user base is that you learn a lot trying to embark on the journey. There are so many things I have so much respect for now. Some skills you really need when trying to build a site include:\u2028 \n\nKnowledge of User Experience and Design - I don’t know if this is the most important thing but it’s certainly one area I’ve found myself sorely lacking in. There are so many things to think about and it's hard to explain how difficult it is to not make a complete mess of what was previously a nice white space.\n\nRespect for Website Architecture - This one very quickly became a nightmare for me. As you move through creating what you think is a cool little page you soon realise you're hard coding everything into the site and so small changes or additions become pretty difficult. The importance of the structure and architecture and planning of the site became clear when I really got stuck into building out the blog.html page. Once you're into building your own CMS to serve your blogs things become much more challenging.\n\nUnderstanding of the limitations of ChatGPT - GPT is a brilliant brilliant tool please do not get me wrong and I'm very grateful to have it but from my experience there are real challenges if you're coming in with no experience and asking it to try and help you build a website. It easily forgets things and as the site builds up it can lead you down some seriously challenging paths. The site wouldn't have been possible without GPT but I will say that I don't think we're in the place where AI replaces everything for quite some time. There are limitations to what it can do, I know that is mis-aligned to the common narrative from the wider online community but in my opinion it's true. All this being said the text at the bottom of the text box does say it all \"ChatGPT can make mistakes. Check important info.\" To close this point off I'll highlight something interesting that I asked GPT and Gemini when I was quite deep into the project. The question was \"Could I write enough code with you to start an online casino?\" The answers I got back were wilding different. \n\nGPT: \"Yes, you could absolutely write enough code to start an online casino with my assistance...\"\nGemini: \"No, you can't write enough code with me to start an online casino...\"\n\nPretty interesting answers in both cases and maybe one is better than the other for reasons that you wouldn't expect. You could potentially waste a lot of time messing around trying to pull that off with GPT whereas the Gemini answer is the one that's truthful... Food for thought in the whole world of thinking that \"Open AI has won the AI battle\" narrative.\n\nI said I would use this post to lay out what to expect in the coming days and weeks and that is what I'll attempt to do to wrap up. What you can expect is that I'll keep building the site and improving the UX, I think that's the most important thing, let's called it priority 1A \"Have an awesome experience that people like using\". Then I'll try and produce content people like, priority 1B and then I'll start experimenting with features to try and keep people interested and coming back, priority 1C. The newsletter sign up is open and I'll use that to send out a weekly update of how the project is going and to also promote the blog posts I write. If you haven't already I'd be hugely grateful if you signed up to our newsletter. We won't spam you and will only email once a week. All the best and thanks for taking the time to read this first SBG blog post. ",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-one.jpg"
    },
    {
        "id": 2,
        "title": "The Growth of the UK Gambling Industry",
        "author": "Gerard McNally",
        "date": "2024-01-02",
        "content": "One post I wanted to write was around the growth of the UK gambling industry of late and what it means for people who like to gamble in the UK. I have struggled from time to time with the overall morality of the industry and whether or not my carefree libertarian ways of my 20's and 30's still make sense. The industry in the UK has definitely gone through some ebbs and troughs over the 20 years I have been in it an I would say certainly from a press perspective is in a place where it has a relatively bad image. I noticed this acutely when I started a business and went to the go-succeed program to try and raise some money in Northern Ireland for my idea. They came back with the following very sobering statement \"As per Go Succeed’s policies, we are unable to engage with businesses that are involved in gambling-related activities due to ethical and reputational concerns. We strive to align with partners whose business practices reflect the values and standards that we uphold.\"\n\nNow they were pretty transparent through the process but it does raise a question as to whether the government wants to encourage any sort of a start up starting to be able to raise cash to enter into this industry and is one area where I'll have to dig a bit deeper. I think if you want to raise money in the industry you are pretty limited to knowing private individuals who have their own funds. \n\nThe reason for really wanting to write this post was to highlight something I saw when I was researching the growth of the UK gambling industry and wanting to call out something that I do have issue with that needs to be highlighted. I've gotten my numbers from https://www.gamblingcommission.gov.uk/statistics-and-research/collection/the-gambling-market. The industry as a whole in the UK is worth a total of 15,6 billion pounds in total gross gambling yield to the exchequer up to March 2024 from March 2023. The last time the UKGC published numbers was in November 2024. The numbers for for this total gross gambling yield break out into five main categories:\n\nArcades - Non Remote\nBetting - Non Remote & Remote\nBingo - Non Remote & Remote\nCasino - Non Remote & Remote\nLotteries - Non Remote & Remote & The National Lottery Non Remote & Remote\n\nGoing back to 2008 which is as far back as the UKGC publishes that I could easily find on their site, the industry was worth about roughly half of what it is worth today. For the period April 2008 to March 2009 the industry was worth 8,36 billion pounds of total gross gambling yield. Back then the total for Casino in terms of gross gambling yield was a paltry 829.25 million, this was, as a percentage of the total yield, 9.91%. Over the course of the last 15 years that number has exploded. Most concerning for me it has exploded in the remote category. The government hasn't gone and allowed the opening a load of land based Casinos they've allowed the proliferation of remote based casinos. \n\nThe total amount the exchequer took from remote based casinos in the period of April 2008 to march 2009 was 33.08 million pounds. That Number has swollen to 4,358 billion pounds in the period April 2023 to March 2024. I understand the conversation about FOBT's and how much harm they were causing but that is an absolute drop in the ocean compared to what has been allowed to happen with remote Casino operators in the UK over the last 15 years. My main issue with allowing this to happen is the addictive nature of mobile phones crossed with the addictive nature of casino games and you have there what is a very explosive combination. The very real difference between online betting and online casino (forgoing some technical issue) is that online betting is beatable for the customer, they actually stand a chance in the long run of winning money overall if they are educated enough. The regulations for certain legalised markets actually bake in how much operators are legally allowed to take from customers in games of chance. In Colombia for example the regs actually state what the return to the customer must be, 83%. So that means for every 100 pesos bet you will only win 83 in the long run, there is no getting past this for the customer assuming the operators technology doesn't have some exploitable loop hole. \n\nThe numbers absolutely speak for themselves in terms of where customers lose their money, Casino revenue for the exchequer in the period 2008 to 2009 was 9.91% of overall gross gaming yield returned (829.25 million of the 8,36 billion total). Today that number stands at 33.42% (5,224 billion of the 15,6 billion total). Over that time betting as a percentage of the total has decreased from 44.07% to 31.11% going from 3,68 to 4,86 billion of gross gaming yield. The reason for this is the absolute explosion on remote Casino gambling and customers betting into products that they stand no chance of winning from in the long run. I guess it's the same with the lottery but those overall percentage numbers have stayed relatively static hovering at or around 30% for the last 15 years. \n\nFrom my perspective and i'm biased but I think the government should be looking long and hard at the growth of revenues from the remote Casino space and asking themselves if these are the sorts of products we want younger people on when they do their first bet or rather make their first wager. I know I'd much rather someone placed a bet that ever downloaded an online casino to their phone, it's just too easy for things to go wrong...\n\nThere is a link to the google sheet I pulled together to see the data clearly laid out. Hope you liked the post and see you tomorrow for another.",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-two.jpg"
    },
    {
        "id": 3,
        "title": "How to build a website using AI",
        "author": "Gerard McNally",
        "date": "2024-12-27",
        "content": "I built this Website with no developer experience. Here is what I learnt...",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-three.jpg"
    },
    {
        "id": 4,
        "title": "The SBG Top 100 Books Series",
        "author": "Gerard McNally",
        "date": "2024-12-28",
        "content": "The Top 10 Books on 'Gambling' on Amazon",
        "image": "blog5.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-four.jpg"
    },
    {
        "id": 5,
        "title": "The SBG Top 100 Books Series",
        "author": "Gerard McNally",
        "date": "2024-12-29",
        "content": "The Top 10 Books on 'Betting' on Amazon",
        "image": "blog6.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-five.jpg"
    },
    {
        "title": "SportsBetGrowth Site Launch",
        "author": "Gerard McNally",
        "date": "2024-12-31",
        "content": "Today is a great day because the CMS is working.",
        "image": "blog7.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-six.jpg",
        "id": 6
    },
    {
        "title": "What I Learnt Working in the Gambling Industry",
        "author": "Gerard McNally",
        "date": "2025-01-01",
        "content": "It was a difficult time. ",
        "image": "blog8.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-seven.jpg",
        "id": 7
    },
    {
        "title": "The SBG 100 Blogs in 100 Days Challenge",
        "author": "Gerard McNally",
        "date": "2025-01-01",
        "content": "I have decided to take on the challenge to write 100 blog posts in 100 days in 2025. Hopefully this will help build the site with some great content.",
        "image": "blog9.jpg",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-eight.jpg",
        "id": 8
    },
    {
        "title": "How to Build a Website Using AI - Part Two",
        "author": "Gerard McNally",
        "date": "2025-01-12",
        "content": "TBC",
        "image": "TBC",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-nine.jpg",
        "id": 9
    }
]