[
    {
        "id": 1,
        "title": "SportsBetGrowth Site Launch",
        "author": "Gerard McNally",
        "date": "2025-01-01",
        "content": "<p>Today is the day where I launch the Sportsbetgrowth website. This blog post will tell you the story of how I got here and the things that triggered me to launching the site. It will hopefully be a story that can inspire others and they can use to start their journey building something for themselves. I recently saw a LinkedIn post by Richell Robin that explained the life of a product manager was tough because \"it's hard to say, \"I built this\"\". That post really captured how I felt as a product person, you don't write code, you don't do designs and you don't sell the product. For this website I took on the role of everything, PM, PO, Developer, Designer and I'll try do the SEO and monetisation. Everything on the site has been built from scratch, the homepage, the blog, the newsletter sign up and automation... everything. This blog post will tell a bit of the background story as to why I did it and what I plan to do next.</p>\n\n<h2>Background and Journey to Sportsbetgrowth.com</h2>\n<p>When I went to school maths came relatively easily to me. It was something I didn't have to study too hard at to get good grades when I was younger. As I moved through school and university that became harder to get away with because the maths became tougher and so my grades slipped a bit. All through school and growing up I loved Sport. I loved playing Sport, I loved watching Sports and I loved thinking about the odds or potential chances of some team winning something.</p>\n\n<p>20 years ago when I was coming out of university the Tony Blair labour government were just coming into power in the UK. They set about a course of really relaxing the legislation related to online gambling. The internet was just finding its feet and it was the perfect storm for online sports betting to flourish. There were some brands out there that no longer exist like Stan James and Blue Square. Paddy Power, William Hill and Ladbrokes were around and Bet365 was but a twinkle in Denise Coates' eye.</p> \n\n<p>I studied Chemical Engineering in University in Belfast and quickly knew this wasn't the thing for me. After leaving University with a very generous 2.2 grade I decided I wanted to try and take on a role in the online sports betting industry. I was lucky to get a job in a William hill shop to start this journey. I knew in my mind it would be a great thing to be an odds compiler. Luckily for me a job opened up three months after I started working for William Hill in Dublin with Paddy Power. This began my journey with what would become Flutter PLC and offered me a great career path.</p>\n\n<h3>My Career and Thinking</h3>\n<p>During my nearly 20 year career working in the gambling industry specifically on Sportsbook I saw and did many things which were brilliant to be a part of. I was given many great opportunities and worked with some great people. Throughout this time as businesses I worked in grew and had great successes there was a feeling that I perhaps didn't deserve the credit I was getting. Being associated with the brands I worked with was great and it always attracted new opportunities and companies that wanted to talk to me because of my experiences. There was a lot of luck involved in the career path I was on.</p> \n\n<p>Overtime I could often feel the mood of the engineering teams become one of frustration with people working in product. At times when product people were supposed to be playing what I would view as enablement role, they would create roadblocks or get into situations that resulted in us slowing down as opposed to speeding up. I could empathise with the engineering teams and for my part always thought \"what really is my contribution here?\". Now that isn't to say all engineering teams and managers were easy to work with, they weren't. Often times during my career I considered quitting and just going back to the very start and trying to get a job as a developer and starting my career all over again. Unfortunately I wasn't that brave.</p> \n\n<h2>How Sportsbetgrowth.com came about</h2>\n<p>What did end up happening was I quit my job in the end. I decided that it was time to go into the real world and live a life of relative uncertainty after all those safe years being addicted to a monthly salary. I really wasn't sure what I wanted to do at all when I quit. It came quite suddenly. I knew in my mind I wanted to try and build something of my own. Something that I knew I could claim credit (or failure) for but at the very least to actually create something. It might be crap and people might never use it and it might not actually do anything but that I could actually say was mine.</p>  \n\n<p>That's what Sportsbetgrowth.com is, the desire of one trader turned product manager to have something that he can call his own. I know it would have been much simpler to use third party applications and do what I've done much quicker and probably better but that's not the path I wanted. I felt like it was a bit of a cop out to use a third party for your blog technology, I guess working for Flutter for all those years taught me one thing... \"Own your own tech\". So everything you see on the site has ben created by me with the help of GPT and canva.com. I hope you like the end result, please if you haven't sign up below for my newsletter and if it turns out to be crap unsubscribe. I promise it'll only be one mail a week. Thanks in advance and have a great day.</p> ",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-one.jpg",
        "slug": "sportsbetgrowth-site-launch"
    },
    {
        "id": 2,
        "title": "The SBG 100 Blogs in 100 Days Challenge",
        "author": "Gerard McNally",
        "date": "2025-01-02",
        "content": "I have decided to take on the challenge to write 100 blog posts in 100 days in 2025. Hopefully this will help build the site with some great content.",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-two.jpg",
        "slug": "the-sbg-100-blogs-in-100-days-challenge"
    },
    {
        "id": 3,
        "title": "My Website Building Adventure: ChatGPT, Challenges, and What's Next",
        "author": "Gerard McNally",
        "date": "2025-01-03",
        "content": "<p>My dream of having a website, specifically one focused on the growing world of sports betting, quickly turned into a crash course in coding, AI limitations, and the importance of planning. I started out thinking, \"I'll just create a static webpage and go from there.\" I had no idea what challenges lay ahead. Here's the story of my website building adventure so far, and what I've learned along the way.</p>\n\n<h2>My Journey So Far</h2>\n<p>I started out exploring sites like wix.com, Wordpress, Squarespace and new entirely AI based site creator called dorik.com. My experience with the CMS website builders wasn’t great, I felt like there was a steep learning curve to be able to use their products. I also felt like there just wasn't the scope for being able to build the product the way you like but maybe I just didn't stick with them for long enough. This led me to dive in and try to do the actual coding myself. To help me build this site I used ChatGPT as a coding co-pilot. One other tool that I used that was essential was canva.com. A lot of the artwork you see on the site is from canva's dreamlab feature.</p>\n\n<p>I am committed to sticking with the site and trying to grow it from 0 users today to some number in the future I can be proud of. I have decided not to define a goal for the active users number because I think actual number based goals in that fashion can be a bit demoralising when you’re shooting for something quite difficult. For me it's akin to something like starting running, if I personally started that with the mindset of \"i'm going to run a marathon\" I'd say i'd quit early. One site that I’ve checked out that is quite similar or that is something I’d aspire to has 12,000 users per month which I think is quite impressive. If I could get anywhere near that in the next 12 to 24 months that would be incredible.</p>\n\n<h2>Lessons learned</h2>\n\n<p>I can say this, starting out on a journey of trying to build something out of nothing in the digital world is quite scary. I think staying off social media and trying not to let it impact you in terms of what people are saying is good advice. That’s quite an easy thing to say but everything you read says you need to use social media to help generate traffic so a bit of a dilemma there in my opinion. What I will also say about trying to build a site and with it a user base is that you learn a lot trying to embark on the journey. This journey has given me a newfound respect for many aspects of website development.</p>\n\n<p>Some skills you really need when trying to build a site include:</p>\n\n<p>Knowledge of user experience and design</p>\n<p>I don’t know if this is the most important thing but it’s certainly one area I’ve found myself sorely lacking in. There are so many things to think about and it's hard to explain how difficult it is to not make a complete mess of what was previously a nice white space.</p>\n\n<p>Respect for website architecture</p> \n<p>This one very quickly became a nightmare for me. As you move through creating what you think is a cool little page you soon realise you're hard coding everything into the site (meaning you're writing the code directly into each page instead of using a more flexible system), and so small changes or additions become pretty difficult. The importance of the structure and architecture and planning of the site became clear when I really got stuck into building out the blog.html page. Once you're into building your own CMS to serve your blogs things become much more challenging.</p>\n\n<p>Understanding of the limitations of ChatGPT</p> \n<p>ChatGPT is a brilliant tool please do not get me wrong and I'm very grateful to have it but from my experience there are real challenges if you're coming in with no experience and asking it to try and help you build a website. It easily forgets things and as the site builds up it can lead you down some seriously challenging paths. The site wouldn't have been possible without ChatGPT but I will say that I don't think we're in the place where AI replaces everything for quite some time. There are limitations to what it can do, I know that is mis-aligned to the common narrative from the wider online community but in my opinion it's true.</p>\n\n<h2>Challenges with AI</h2>\n<p>All this being said the text at the bottom of the text box does say it all \"ChatGPT can make mistakes. Check important info.\" To close this point off I'll highlight something interesting that I asked ChatGPT and Gemini when I was quite deep into the project.</p>\n\n<p>The questions were:</p>\n\n<p>ChatGPT: \"Could I write enough code with you to start an online casino?\"</p>\n<p>Gemini: \"Could I write enough code with you to start an online casino?\"</p>\n\n<p>The answers I got back were wildly different.</p>\n\n<p>ChatGPT: \"Yes, you could absolutely write enough code to start an online casino with my assistance...\"</p>\n<p>Gemini: \"No, you can't write enough code with me to start an online casino...\"</p>\n\n<p>Pretty interesting answers in both cases and maybe one is better than the other for reasons that you wouldn't expect. You could potentially waste a lot of time messing around trying to pull that off with ChatGPT whereas the Gemini answer is the one that's truthful... Food for thought in the whole world of thinking that \"Open AI has won the AI battle\" narrative.</p>\n\n<h2>Future Plans</h2>\n\n<p>I said I would use this post to lay out what to expect in the coming days and weeks and that is what I'll attempt to do to wrap up. What you can expect is that I'll keep building the site and improving the UX, I think that's the most important thing, let's called it priority 1A \"Have an awesome experience that people like using\". Then I'll try and produce content people like, focusing initially on topics like understanding betting odds and bankroll management. Priority 1B and then I'll start experimenting with features to try and keep people interested and coming back, possibly things like a weekly betting tip or a community forum. Priority 1C.</p>\n\n<p>This is just the beginning of my journey with SportsBetGrowth. It's been challenging, frustrating, and incredibly rewarding all at the same time. I'm excited to keep learning, building, and sharing my experiences with you. If you're interested in following along, sign up for my newsletter below. I promise to only send one email a week, sharing updates, new blog posts, and maybe even some tips on navigating the world of sports betting. Thanks for reading!</p>\n\n<p>Want to stay up-to-date on my progress and get exclusive sports betting insights? Sign up for my weekly newsletter below!</p>",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-three.jpg",
        "slug": "my-website-building-adventure-chatgpt-challenges-and-what-s-next"
    },
    {
        "id": 4,
        "title": "From No Code to Website Launch: My AI Experiment",
        "author": "Gerard McNally",
        "date": "2025-01-04",
        "content": "<p>Could I really build a website using just AI, despite having zero experience with front-end code? I decided to put it to the test, embarking on an ambitious project to create a website from scratch, armed with nothing but AI tools like ChatGPT and Canva and a healthy dose of determination. I'd never built a website before but thought that it would be a great challenge to undertake while I figured out what I wanted to do next in my career. It's turned out to be a far more challenging project than I ever imagined. This project, while more demanding than I could have ever imagined, has taught me a few invaluable lessons: it's not as simple as some suggest, it demands a great deal of patience, but it's undeniably possible to build something functional and real. While I've never built a website before, I did have some experience previously writing a backend Python application. It calls the Betfair Exchange API and places bets automatically for me. This endeavour, far more demanding than I anticipated, has been a masterclass in patience, problem-solving, and the surprising capabilities of AI.</p>\n\n<h2>What am I trying to achieve?</h2>\n<p>In terms of what I'm trying to do, I am trying to build something from scratch on my own that has 0 users today and to try and scale that to have say 1000 users per month within the next 12 months. I would then like to be able to monetise those users in some manner. In doing this I want to build a product that is legitimate. I want to build a product that helps people and that they enjoy using and that they have an overall positive experience with. When you lay it out like that it's a huge challenge, and success is far from guaranteed but that's part of the excitement. I'm learning more than I could have imagined about new tools and approaches to problems and even if I don't make it to 1000 users per month right away, the skills I'm learning will be valuable to me at some point down the road. Ideally I'll be working for myself and not for a company that isn't my own. Having a company job and everything that goes along with that is amazing. I'm very grateful for all the safety and security I was provided by all the companies that have employed me in the past (and this isn't to say I don't want to work for a company again). My next career aspiration is and always will be to be able to build something myself that ticks all the boxes above and is my own.</p>\n\n<h2>The Realities of Building a Website with AI: Tougher than I Imagined</h2> \n<p>To begin with I gave Chat GPT some high level requirements for what I wanted, asked it a few questions, told it to behave like an expert developer and voila I got the first iteration of SportsBetGrowth.com. Then as I wanted to build further features or do simple things like getting the size of some text right or aligning elements on the page the process became increasingly time consuming. I'd ask for help with solutions but understanding some of the suggestions that came back took a lot of trial and error. Debugging with ChatGPT can also be overwhelming. The responses, while helpful, often require careful study and adaptation to fit your specific code. Looking back, I never imagined that a simple idea – \"build a website with AI\" – would lead me down such a challenging and fascinating path. It's tested my patience, pushed my creative limits, and forced me to learn at a breakneck pace. These early hurdles made it clear that I needed to rethink my approach and set more realistic goals.</p> \n\n<h2>Set Challenging but Realistic Goals</h2> \n<p>I realised I was probably setting pretty unrealistic targets for myself to be able to actually launch the website. I'd say it was probably four or five weeks into the project that I was able to slow down a bit and realise that a full website wouldn't be achievable in the first two months. My advice to anyone starting out who wants to achieve the same goal is to accept that it will take time. There are highly competent technical people who could do it in a matter of days but that doesn't mean that is the measure of success for your project. Based on my experience I would say if you can get something together and be ready to launch it within three months that would be a phenomenal achievement. It's important to note that I wasn't working on this project full-time. I was also juggling consulting work and other commitments.</p>\n\n<h2>Positive Things Ahead</h2> \n<p>While the initial vision of a bustling site with 1000 users is still a work in progress, I'm proud of how far I've come, particularly with features like the blog and its dedicated CMS, as well as the newsletter signup and automation functionality. In my next post, I'll dive into the specifics of building the homepage, including the triumphs and tribulations of wrangling with navbars, hero sections, and more. One of the main features that I love about the site is the blog and its own dedicated CMS that I have built. I have also built all of the newsletter sign up functionality and automation. In future posts I'll detail the various things that went into those features, including the challenges\tI faced and the solutions I found. The journey is far from over. If you've tried to build your own site and have a story you want to share please link it in the comments. It would be great to see how you've done and to understand any learnings you have gained as a result of your work. If you haven't already please sign up for our newsletter below. Stay tuned! </p>",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-four.jpg",
        "slug": "from-no-code-to-website-launch-my-ai-experiment"
    },
    {
        "id": 5,
        "title": "Building My Homepage with AI: A Deep Dive into Navbars, Heros, and Headaches",
        "author": "Gerard McNally",
        "date": "2025-01-05",
        "content": "<p>In my previous post, I shared why I embarked on this journey of building a website with AI. Now, let's get down to the details. Building a website, even with AI assistance, is no walk in the park. One of the biggest hurdles? Designing the homepage. It might seem simple, but trust me, it's a beast of its own. If I could start over, I'd spend a week or two defining the essential features and pages for launch and be ruthless about cutting anything extra. You can easily get carried away building minor elements and lose sight of the goal; launching a website, not endlessly styling CSS.</p> \n\n<h2>Homepage Launch Features</h2>\n<p>To give you a better idea of the challenges, let me walk you through the main sections I decided to put in my homepage and the challenges I overcame with each one.</p> \n\n<h2>Navbar</h2>\n<p>This took a long time to get anywhere close to being right. You think it's just a few links, a logo and a button but the main challenge is having the thing be responsive for mobile devices. If I were to do it again I'd have two requirements: Navbar for desktop and Navbar for mobile. I probably spent a week of my life examining other sites mobile hamburger menus or lack thereof.</p>  \n\n<p>My favourite mobile navbar is on https://uk.rad-global.com/collections/r-a-d-one it's really cool you should check it out.</p> \n\n<h2>Hero Section</h2>\n<p>This is the section you see on a website that is basically everything you see before you have to scroll. This took me a long time and I found it very difficult to design. I went through many iterations of the code before I settled on what I have. It has one heading, one paragraph, a CTA (call to action) button and the hero image. Stripping everything back and trying to be a simplistic as possible was the best path forward for me with this.</p>  \n\n<h2>Why Sign Up?</h2>\n<p>This section could probably use a better name but the idea behind this section is to give the user reasons to sign up to the newsletter and to let them know what they will get for signing up. Chat GPT is quite fond of proposing a grid as the solution to a front end user experience problem (or maybe it knows I like grids and just proposes them all the time now - I'm not sure).</p>  \n\n<h2>Brands I've Worked On</h2>\n<p>This was probably one of the simpler parts of the site, although it did take me some time to figure out how to re-size an image in canva and to get all the text to align on desktop. It gets a bit frustrating when you have your mobile experience all lined up but are spending time on the UX for desktop. My experiences from the past are that no one cares about the desktop experience the deliver to customers anymore. \"Mobile first\" was an oft touted phrase to use to gain success in my early career in the gambling industry.</p> \n\n<h2>Hear from our Subscribers</h2>\n<p>This section is all about \"social proof\" which is a new concept for me since I've started into trying to build something of my own. In terms of building it with AI that was pretty straightforward when you just want something static to capture feedback from your first few mates who use the product. The challenge that's awaiting me is building out a small back end and database for it so I don't have to do an integration with a third party.</p> \n\n<h2>Latest Blogs</h2>\n<p>This was the most challenging part of the site to build to date and the one I had most trouble with overall. I would say this is where I can provide some learnings to others. I originally had this as a hard coded part of the site. When I first built it I then went off and did some relatively simple UX bits and pieces (probably focusing on the hero section and styling it to death). When I then turned my attention to actually writing some blogs it became abundantly obvious it would need a database and lot more work to allow me to actually interact with it. It was that or I would be in the code everyday trying to copy and paste 1000 words. That was a recipe for chaos and probably could spawn an entire blog of its own.</p> \n\n<p>So, there you have it – a journey of building a homepage with AI. I've battled uncooperative navbars, wrestled with hero section designs, and learned the hard way that hardcoding your blog section is a recipe for disaster. But I've also discovered the power of AI to help me overcome these challenges and bring my vision to life (even if it's taken a bit longer than expected). The next big hurdle? Building a proper database to make my blog section dynamic and user-friendly. What homepage challenges have you faced? Share your experiences in the comments below, and don't forget to sign up for my newsletter to follow along as I tackle the next big hurdle: building a dynamic database for my blog!</p> ",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-five.jpg",
        "slug": "building-my-homepage-with-ai-a-deep-dive-into-navbars-heros-and-headaches"
    },
    {
        "id": 6,
        "title": "The SBG Top 100 Books Series",
        "author": "Gerard McNally",
        "date": "2024-01-06",
        "content": "I decided I wanted to write a blog post about the top 100 books I could find from making searches for certain keywords on Amazon. I started out with the idea of searching for the term \"gambling\" on Amazon to understand what books would make it into the featured search list and what the list looked like from a trends perspective. I hoped that maybe I'd find some new gems to read that would tell the history or story of gambling and the intrinsic link between gambling and the overall evolution of humanity. As I reflected on what I saw I also then decided to search for other keywords that you could say were in some way related to my search for the term \"Gambling\". One other term related to \"Gambling\".\n\nSo as I searched on amazon for the term \"Gambling\" there was a pretty obvious theme that came up that was again a trigger for me to consider the overall morality of having worked in the Sports Betting industry for my entire adult life. In the list as I made my initial scan of it the concept of addiction or problem gambling or needing to stop gambling was very evident in the list of books that were return. While being disappointed initially the search was quite interesting for me as I felt like it told a bit of a story about gambling in general and how it is currently received in the mainstream. So for qualifiers on the search I actually did I made the search using a Cypriot internet connection and on my own logged in Amazon account (maybe they personalise results). There were 323 total results for the search and surprisingly for me books that have 0 or very poor reviews can jump to the top of featured. I'm not sure if that's an opportunity or not and how you could possibly influence the featured tab on amazon for specific search terms but that's probably a mission for another day.\n\nWhat I will say about the featured books when you search for gambling is that it doesn't make for a particularly compelling list of reads in my opinion if you review the list. 6 of the top 10 books contain the words \"Addiction\", \"Stop\" or \"Addict\" or some combination of all three. To go a little deeper 16 of the top 49 books on gambling reference the word \"addiction\", \"stop\" or \"addict\". I think that creates a picture that people don't particularly come to amazon to learn how to be a better gambler they come to Amazon when they have a problem and are seeking a solution to their problem gambling. In my review of the list I went deep enough, actually pulling in the titles of the top 49 books on the featured tab into a google sheet.\n \nThis is where I took a little bit of a direction changes to understand if this sort of narrative existed with other \"vices\" when you searched for books on them. My next port of call was a search for the term \"drinking\" and it's a similar story with 8 of the top 10 books referencing stopping drinking in some sense or other. I'll be honest I was expecting a lower number of stopping or addiction related results.\n\nWhere things got more interesting is an amazon search of the word \"cocaine\" brings back an altogether different list of books. In that top 10 of featured books on cocaine only a paltry 4 out of 10 books deal with addiction. Some of the titles returned are altogether pretty shocking. \"Cocaine for beginners\", \"101 ways to sell cocaine\", \"how a small town boy made $100 million with the Medellin cartel\" and \"The king of UK cocaine smugglers\" are notable entries in the top 10 list. Another notable mention at number 11 in the list is the incredibly titled \"The pleasures of Cocaine\". I'm in no way trying to trivialise the harmful nature of problem gambling but could you imagine a list of books related to gambling that included a book title called \"The pleasures of legalised online sports betting\" - I think you would essentially be commissioning a small army of very upset people from the UK to camp outside your home demanding a withdrawal of your book of heresy. Two other notable mentions in the cocaine list include \"Cocaine Cowboys\" twice and another very glamorous title called \"Cocaine + Surfing\". I think Cocaine and surfing are probably two things I could never see going together but \"a sordid history of surfings greatest love affair\" seems to strike an entirely different tone. \n\nNow to really ramp things up in this conversation of problem vices and perception I then amazon searched the somewhat safer term of \"cannabis\". You will be shocked to find out that there is only one entry in the top 10 list of featured books that references any sort of help with quitting cannabis smoking or consumption. I'm not trying to equate vices but cannabis in the UK is an illegal class B substance, if you were unaware of this were to use this amazon search as the basis for what is legal and illegal you would say Gambling & Drinking are absolutely illegal given their damaging nature and Cocaine and Cannabis consumption and distribution are laudable things that are definitely legal. \n\nFor me personally the glamorisation of cocaine smuggling and use in the list of books in the amazon featured list and contrasting that with what is happening with gambling is a very difficult one to rationalise. Going back to a previous topic we've hit on in the blog previously I do have a problem with the unabated growth of legalised remote based Casino betting and the difficulties that creates for people based on the Random Number Generated backbone of the product and the propensity for customers to lose money betting on these casino based games. If the product is actually beatable for a customer then I think it's an entirely different proposition and people should be able to clearly see that distinction. Maybe they're features of prohibition and legality... but it still feels off. \n\nIt is interesting that we do have a culture where you can just write a book about something as serious as addiction and get it published. I'm not trying to say that for certain all authors who publish books about something so serious as a gambling addiction but I do think it's an interesting feature of society. Person, who may or may not be qualified, writes book that a person picks up and reads in the hope of coming to some realisation that may well help them with something like a gambling addiction. ",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-six.jpg",
        "slug": "the-sbg-top-100-books-series"
    },
    {
        "id": 7,
        "title": "The SBG Top 100 Books Series",
        "author": "Gerard McNally",
        "date": "2024-01-07",
        "content": "<p>For today's blog I'll continue where we left off yesterday with the SBG top 100 Books series. I have created this series because I'm a big fan of books and wanted to create a series of interesting posts using search terms on Amazon related to the industry. Today I'll write 1000 words on of the amazon book search for the term \"betting\". I can tell you from the early results of the search that it's a lot more positive for the industry and than the term \"gambling\". If you read yesterday's post you'll have learnt that the word gambling has a negative sentiment attached to it. This you'll have learnt has spawned the production a large number of books designed to help the reader stop this perverse activity.</p> \n\n<h2>A Brighter Term for the Industry</h2>\n<p>In terms of the overall content in the search for betting on amazon search for books, you'll find in this list no mention whatsoever of the potential for problem gambling or harm. This list of books is focused more on systems and advice given by experts from the field. The first book on the list references Monte Carlo simulations and their ability to help the bettor be more informed. A Monte Carlo simulation is a mathematical technique that simulates the range of possible outcomes for an uncertain event. There are many sites out there that can help build a Monte Carlo simulator to help you better understand what they do.</p> \n\n<p>The second book in the list refers to the Betfair Exchange and the fact this book can make you a better trader if you read it. I've seen the betfair exchange take a lot of heat online. In my opinion it's a great tool for bettors. This is somewhere you can go to gain an understanding of the 100% price for an outcome especially for the likes of Football, Horse Racing and Tennis. Other sports suffer from a liquidity perspective. The issue the exchange has had is the penalties it imposes on its biggest winners. It has also been unable to attract unsophisticated players into the player pool and so the ecosystem has had a very challenging time. When you add into that that sportsbooks can offer the casual bettor a much wider array of betting opportunities, it's been tough going. The exchange recently released an update to their premium charge, the fee they charge the biggest winners but that hasn't seemed to be well received in the articles I've seen on the new development.</p> \n\n<h2>Betting Basics</h2>\n<p>The third book on this list is written by Ed Miller and Matthew Davidson and is called \"The Logic of Sports Betting\". I know some of Ed Millers other work and his book written with David Slansky on No Limit Hold em was a great read that I thoroughly enjoyed. The Logic of Sports Betting gets some great reviews, scoring 4.4 of 5 for 705 reviews overall. Amazon have a great feature that show's popular highlights in the book and this one has three great ones I'd like to discuss. \"Figuring out the hold in every market is the first step in finding a good bet.\" I think advice rings true and hits on a point I'd like to make in future blog posts. To explain what the term hold means, this is the over round that a betting market is bet to. For example in a two runner market if the prices are 1/2, 6/4 or -200, +150, 1.66 2.5, the over round or hold is 106%. That additional 6% over 100% ensures that customers cannot bet both sides to make a profit.</p>  \n\n<h2>Sportsbook Strategies</h2>\n<p>One of the key sports book strategies for creating a highly profitable enterprise is to encourage players to bet into their higher margin products. All the rage these days are player performance markets where customers can bet on their favourite player. The issue with these markets, let's take anytime goalscorer for example (insert touchdown scorer, point scorer etc..), is that the over round or hold is enormous. The reason for this is the markets generally contain big prices. The markets are also highly subject to team strategy and line up information. What makes these markets worse for customers is when you combine them with other selections, either in the same game, or with other selections to win you multiple the margin or hold that that the book theoretically takes from you. This isn't to say these markets are not beatable. You can be sure if you start beating a book to the punch on team news in a market and beating their price moves you will have your business restricted.</p>  \n\n<h2>A Challenge to Certain Thinking</h2>\n<p>One of the other popular highlights Amazon provides from the Miller and Davidow book is \"Treat sports betting like an easter egg hunt. When all the kids run one direction, you run the other. Look for the eggs a little less out in the open. It's more fun anyway.\" I can see the sentiment with this particular quote, go where others aren't look in places less well travelled etc... I just think in terms of a sustainable strategy to stay unrestricted and to be able to get enough money down to continue to bet professionally you need to be able to beat the main game lines. That's markets like money line, spread and total points or for soccer win / draw / win. You can find a lot of value pretty easily in derivatives markets like anytime goalscorer etc but you won't make a living for long picking books off on those prices.</p>  \n\n<h2>To Wrap Up</h2>\n<p>I hope you enjoyed the post today and some of the insights in the blog. If you haven't already sign up for out weekly newsletter where we'll roll out the big guns and give you actionable advice that shed light on the industry and help you stay clear of the common pitfalls most bettors run into. Thanks for reading and please subscribe below.</p> ",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-seven.jpg",
        "slug": "the-sbg-top-100-books-series-1"
    },
    {
        "id": 8,
        "title": "What I Learnt Working in the Gambling Industry",
        "author": "Gerard McNally",
        "date": "2025-01-08",
        "content": "It was a difficult time. ",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-eight.jpg",
        "slug": "what-i-learnt-working-in-the-gambling-industry"
    },
    {
        "id": 9,
        "title": "The Growth of the UK Gambling Industry",
        "author": "Gerard McNally",
        "date": "2024-01-09",
        "content": "<p>The UK gambling industry has exploded over the last 15 to 20 years. In this post, I'll share my personal experiences in the gambling industry. I'll also analyse data from the UK Gambling Commission website. My analysis of the data reveals a concerning trend: the unchecked growth of online casinos. This growth has potential consequences for the entire industry. This isn't just about numbers; it's about the potential for real harm and the need for a serious conversation about responsible gambling in the digital age. It's time for a serious conversation about responsible gambling in the digital age and this conversation needs to focus on the unchecked growth of online Casinos.</p>\n\n<p>I've often struggled with the morality of the gambling industry. I question whether my more libertarian views from my 20s and 30s still apply. The UK gambling industry has seen ups and downs over the past 20 years. From a press perspective, I'd say it currently has a relatively bad image. I experienced this firsthand when I started a business. I applied for funding through the Go Succeed program, a local initiative in Northern Ireland, but was denied. After a few interviews with them they came back with the following very sobering statement \"As per Go Succeed’s policies, we are unable to engage with businesses that are involved in gambling-related activities due to ethical and reputational concerns. We strive to align with partners whose business practices reflect the values and standards that we uphold.\"</p>\n\n<p>While they were transparent, it raises questions about the government's priorities. Who is influencing gambling policy in the UK? Incentive programs for businesses that might disrupt the status quo are clearly not a priority in Northern Ireland. Generally, raising money in the gambling industry is difficult. You're often limited to private individuals with their own funds.</p>\n\n<h2>The Rise of Online Casinos</h2>\n<p>On to what I really wanted to highlight with this post. I was recently researching the growth of the UK gambling industry over the last 15 years and I came upon some numbers that create a pretty stark picture of where we're heading. For clarity all numbers referenced in this blog post come from https://www.gamblingcommission.gov.uk/statistics-and-research/collection/the-gambling-market. The gross gambling yield of the Great Britain gambling industry was 15.6 billion pounds for the year ending March 2024. The last time the UKGC published numbers was in November 2024. The numbers for for this total gross gambling yield break out into five main categories:</p>\n\n<p>Arcades - Non Remote</p>\n<p>Betting - Non Remote & Remote</p>\n<p>Bingo - Non Remote & Remote</p>\n<p>Casino - Non Remote & Remote</p>\n<p>Lotteries - Non Remote & Remote & The National Lottery Non Remote & Remote</p>\n\n<p>Going back to 2008 which is as far back as the UKGC publishes that I could easily find on their site, the industry was worth about roughly half of what it is worth today. For the period April 2008 to March 2009 the industry was worth 8,36 billion pounds of total gross gambling yield. Back then the total for Casino in terms of gross gambling yield was a paltry 829.25 million, this was, as a percentage of the total yield, 9.91%. Today the total gross gambling yield for Casino as a whole stands at 5,22 billion pounds. Most concerning for me it has increased significantly in the remote category. The non-remote numbers have stayed relatively stable over the last 15 years, the remote number has increased from 33 million in 08/09 to 4,36 billion in 23/24 - a staggering increase of over 13,000%. The government hasn't gone and allowed the opening a load of land based Casinos they've allowed the proliferation of remote based casinos i.e. online casino.</p>\n\n<p>I understand the conversation about FOBT's (Fixed Odds Betting Terminals) and how much harm they were causing but that is an absolute drop in the ocean compared to what has been allowed to happen with remote Casino operators in the UK over the last 15 years. The explosive growth in online casino feels even more concerning when you consider the nuanced differences between Casino and Sports Betting.</p>\n\n<h2>The Difference Between Sports Betting and Casino</h2>\n<p>Online betting differs from online casino by the fact that customers do stand a chance of being a winner in the long run. This is something that makes both products distinctly different. The regulations for certain legalised markets actually bake in how much operators are legally allowed to take from customers in for Casino games. In Colombia (a regulated market) for example the regs actually state what the return to the customer must be, 83%. So that means the maximum the operator is allowed to take from customers in the long run is 17%, i.e. 17 pesos for every 100 that is bet. This regulation is designed to protect customers by limiting how much operators can profit from Casino games.</p>\n\n<p>The numbers absolutely speak for themselves in terms of where the real growth in the industry has come. Today the Casino number stands at 33.42% (5,224 billion of the 15,6 billion total) of the total gross gambling yield overall in the UK. Over that time betting as a percentage of the total has decreased from 44.07% to 31.11%. In real terms going from 3,68 to 4,86 billion pounds of gross gaming yield. My real concern is that customers are increasingly playing on products that they stand no chance of winning from in the long run. I guess it's the same with the lottery but those overall percentage numbers have stayed relatively static hovering at or around 30% for the last 15 years.</p>\n\n<h2>The Government's Role</h2>\n<p>From my perspective, while I understand that gambling is by and large a source of harmless entertainment for the many. While there have been many measures introduced for responsible gambling like deposit limits, reality checks and self exclusion programs, I believe they're not enough. They don't prevent those determined enough from causing themselves harm. I think the government should be looking long and hard at the growth of revenues from the remote Casino space. A serious question needs to be asked if these are the sorts of products we want newcomers to gambling using as their first product. I know I'd much rather someone placed a sports bet than ever downloaded an online casino to their phone, it's just too easy for things to go wrong... Ultimately I think the government in the UK should consider whether they want online Casino to continue to grow in the fashion it has over the last 15 years because we're currently on a trajectory where it will soon dominate the gambling landscape.</p>\n\n<p>The data is clear and the trend is only heading in one direction for remote Casino, and we need to act now to change course. We need a serious conversation and clear distinctions made between customers who place bets on sports and have a chance of being a winning player in the long run a customers who ultimately stand no chance of winning in the long run playing Online Casino. The sports betting industry takes an enormous amount of negative press and yet the growth of Online Casino proceeds uninhibited. I urge you to contact your local MP about your concerns regarding the growth of online casinos.</p>\n\n<p>There is a link to the google sheet I pulled together to see the data clearly laid out. Hope you liked the post and see you tomorrow for another.</p>",
        "image": "static/images/index/Review-One.png",
        "author-image": "static/images/authors/gerard-mcnally.png",
        "blog-image": "static/images/blog/blog-post-nine.jpg",
        "slug": "the-growth-of-the-uk-gambling-industry"
    }
]